Console.WriteLine("PgCs schema analyzer");

/*
 * TODO:
 * 1) Добавить поддержку описания поля в комментарии, вида -- commnt: Комментарий; type: BIGINT; name: ID; или -- comment(Комментарий); type(BIGINT); name(ID);
 * 2) Проверить, что BlockExtractor использует inline комментарии со служебными словами и извлекает значения
 * 3) Добавить поддержку во View этой информации. Так как во view используется select, нужно сделать так, чтобы данные брались для описание колонок из sqlBlock который в свою очередь взял данные для колонки из комментария
 * 4) Так же предусмотреть, чтобы для создания ViewDefinition передавался не один блок а например 2 и более, в которых будут переданы таблицы , используемые в запросе создания view. Это позволит без комментариев получить типы данных колонок.
 * 
*/